In [11]:
import pandas as pd
import numpy as np

# Question 1

Consider the two DataFrames shown below, both of which have Name as the index. Which of the following expressions can be used to get the data of all students (from student_df) including their roles as staff, where nan denotes no role?

```python

pd.merge(student_df, staff_df, how='left', left_index=True, right_index=True)

pd.merge(staff_df, student_df, how='right', left_index=False, right_index=True)

pd.merge(staff_df, student_df, how='left', left_index=True, right_index=True)

pd.merge(student_df, staff_df, how='right', left_index=True, right_index=True)

In [12]:
student_df = pd.DataFrame({ "Name" : ["James", "Mike", "Sally"], 
                           "School" : ["Business", "Law", "Engineering"]})

student_df  = student_df.set_index('Name')

In [13]:
staff_df = pd.DataFrame({ "Name" : ["Kelly", "Sally", "James"], 
                           "Role" : ["Director of HR", "Course Liason", "Grader"]})

staff_df = staff_df.set_index('Name')

In [14]:
pd.merge(student_df, staff_df, how='left', left_index=True, right_index=True)

            School           Role
Name
James     Business         Grader
Mike           Law            NaN
Sally  Engineering  Course Liason

# Question 2

Consider a DataFrame named df with columns named P2010, P2011, P2012, P2013, 2014 and P2015 containing float values.  We want to use the apply method to get a new DataFrame named result_df with a new column AVG. The AVG column should average the float values across P2010 to P2015. The apply method should also remove the 6 original columns (P2010 to P2015). For that, what should be the value of x and y in the given code?

```python

frames = ['P2010', 'P2011', 'P2012', 'P2013','P2014', 'P2015']
df['AVG'] = df[frames].apply(lambda z: np.mean(z), axis=x)
result_df = df.drop(frames,axis=y)

# Question 3

Consider the Dataframe df below, instantiated with a list of grades, ordered from best grade to worst. Which of the following options can be used to substitute X in the code given below, if we want to get all the grades between 'A' and 'B' where 'A' is better than 'B'?

```python
import pandas as pd
df = pd.DataFrame(['A+', 'A', 'A-', 'B+', 'B', 'B-', 'C+', 'C', 'C-', 'D+', 'D'], index=['excellent', 'excellent', 'excellent', 'good', 'good', 'good', 'ok', 'ok', 'ok', 'poor', 'poor'], columns = ['Grades'])
my_categories= X
grades = df['Grades'].astype(my_categories)
result = grades[(grades>'B') & (grades<'A')]

In [16]:
df = pd.DataFrame(['A+', 'A', 'A-', 'B+', 'B', 'B-', 'C+', 'C', 'C-', 'D+', 'D'], index=['excellent', 'excellent', 'excellent', 'good', 'good', 'good', 'ok', 'ok', 'ok', 'poor', 'poor'], columns = ['Grades'])
my_categories = pd.CategoricalDtype(categories=['D', 'D+', 'C-', 'C', 'C+', 'B-', 'B', 'B+', 'A-', 'A', 'A+'], ordered=True)
grades = df['Grades'].astype(my_categories)
result = grades[(grades>'B') & (grades<'A')]

result

excellent    A-
good         B+
Name: Grades, dtype: category
Categories (11, object): ['D' < 'D+' < 'C-' < 'C' ... 'B+' < 'A-' < 'A' < 'A+']

# Question 4

In [19]:
df = pd.read_csv('cwurData.csv')

def create_category(ranking):
    # Since the rank is just an integer, I'll just do a bunch of if/elif statements
    if (ranking >= 1) & (ranking <= 100):
        return "First Tier Top Unversity"
    elif (ranking >= 101) & (ranking <= 200):
        return "Second Tier Top Unversity"
    elif (ranking >= 201) & (ranking <= 300):
        return "Third Tier Top Unversity"
    return "Other Top Unversity"

# Now we can apply this to a single column of data to create a new series
df['Rank_Level'] = df['world_rank'].apply(lambda x: create_category(x))
# And lets look at the result

df.head()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year,Rank_Level
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012,First Tier Top Unversity
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012,First Tier Top Unversity
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012,First Tier Top Unversity
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012,First Tier Top Unversity
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012,First Tier Top Unversity

In [22]:
# Now let's create the pivot table for the median

df.pivot_table(values='score', index= 'country', columns='Rank_Level', aggfunc=[np.median]).head()

                             median                      \
Rank_Level First Tier Top Unversity Other Top Unversity
country
Argentina                       NaN              44.390
Australia                    48.055              44.580
Austria                         NaN              44.630
Belgium                      51.875              44.715
Brazil                          NaN              44.365


Rank_Level Second Tier Top Unversity Third Tier Top Unversity
country
Argentina                        NaN                      NaN
Australia                     49.125                   47.285
Austria                          NaN                   47.030
Belgium                       49.600                   46.890
Brazil                        49.565                      NaN